public interface Finals {
  String SPACE = "\u2009\u2009";
  String RESET = "\u001B[0m";
  String RED = "\u001B[31m";
  String GREEN = "\u001B[32m";
  String YELLOW = "\u001B[33m";
  String BLUE = "\u001B[34m";
  String PURPLE = "\u001B[35m";
  String CYAN = "\u001B[36m";
  String WHITE = "\u001B[37m";
  String HEADER = """
      ┌────┬─────────────────────────┬────────────────────────────────────────┬───────────┬───────────┬───────────┬────────┐
      │ Id │ Задача                  │ Описание задачи                        │ %sКатегория%s │ %sПриоритет%s │    %sДата%s   │ %sСтатус%s │
      ├────┼─────────────────────────┼────────────────────────────────────────┼───────────┼───────────┼───────────┼────────┤""";

  String FOOTER = """
      └────┴─────────────────────────┴────────────────────────────────────────┴───────────┴───────────┴───────────┴────────┘""";
  String logo = String.format("""
              
      %s   ┌─                  ─┐
      %s═══╡│%s T A S K  L I S T%s │╞════════━━━━━┅┅┅┅┅┅┄┄%s┄┄┄┈┈┈┈
      %s   └─                  ─┘%s
        """, YELLOW, CYAN, YELLOW, CYAN, YELLOW, CYAN, RESET);
}
